--- a/README.md
+++ b/README.md
@@ -38,50 +51,31 @@ http://www.plantuml.com/plantuml/uml/SyfFKj2rKt3CoKnELR1Io4ZDoSa70000
+## view in Haroopad
 
-Sequence Diagram0 Sequence
-```mermaid
- sequenceDiagram;
-participant _KCacheManager;
-participant _KDataLoader;
-participant Hot;
-_KCacheManager->>_KDataLoader:1.Message0
-_KDataLoader->>Hot:2.CreateMessage
-Hot->>Hot:3.Message7
-_KCacheManager->>_KDataLoader:4.Message5
-_KDataLoader-->>_KCacheManager:reply.123
-_KCacheManager-x_KDataLoader:5.Message5
-Hot-x_KDataLoader:6.getDataforMapDisp
-_KDataLoader->>Hot:6.1.CreateMessage
-_KDataLoader->>Hot:6.2.MessageRR
-Hot-->>_KDataLoader:reply.
-_KCacheManager-x_KDataLoader:7.Message1
-Hot-x_KDataLoader:8.Message0
-_KCacheManager-x_KDataLoader:9.Message1
-Hot->>_KDataLoader:10.DestroyMessage
-```
+![](https://github.com/Avens666/Astah_Jude_UML_export_to_Markdown-mermaid-Plantuml-/blob/master/img/Image4.jpg)
 
-Plantuml demo
@@
-_KCacheManager ->> _KDataLoader:9.Message1
-Hot -> _KDataLoader:10.DestroyMessage
-@enduml
+  @startuml
+  participant _KCacheManager
+  participant _KDataLoader
+  participant Hot
+  _KCacheManager -> _KDataLoader:1.Message0
+  _KDataLoader -> Hot:2.CreateMessage
+  Hot -> Hot:3.Message7
+  _KCacheManager -> _KDataLoader:4.Message5
+  _KDataLoader ->> _KCacheManager:reply.123
+  _KCacheManager ->> _KDataLoader:5.Message5
+  Hot ->> _KDataLoader:6.getDataforMapDisp
+  _KDataLoader -> Hot:6.1.CreateMessage
+  _KDataLoader -> Hot:6.2.MessageRR
+  Hot ->> _KDataLoader:reply.
+  _KCacheManager ->> _KDataLoader:7.Message1
+  Hot ->> _KDataLoader:8.Message0
+  _KCacheManager ->> _KDataLoader:9.Message1
+  Hot -> _KDataLoader:10.DestroyMessage
+  @enduml
 -->
 
-http://www.plantuml.com/plantuml/png/XL4x3eCm3Drp2Yv0nAT0oy02GwMMXGjK5dKfKaMY90ktBmYYWa5bjD_p-yWIb6dhLa9ddCSjX_gD9NJGe69o1HLWu2xWIO2hC6nzvxZPYfxwl4Ij1yXZo_t86wxJWESAmU1COiFEGg6zJ8uyJfOP4GytoqYlLA7yzDmFmgqeKOr-gbCgWiUyGJFEBw5Aa4MhvMx5cFkav3uhi7vLDHbk7AViXy4JA-Jl1pylN_9VwaAbo7CzNg0sIlGpxGi0
